{"0":{"from":"WCSB","to":"Mandi","time":7.2,"summary":"","directions":"Head northwest on Oudenarder Straße. Go for 56 m.Turn left onto Seestraße. Go for 366 m.Arrive at Seestraße. Your destination is on the right."},"1":{"from":"Mandi","to":"Las Vigas","time":8.2833333333,"summary":"","directions":"Head southwest on Seestraße. Go for 247 m.Turn left onto Müllerstraße. Go for 239 m.Arrive at Müllerstraße. Your destination is on the right."},"2":{"from":"Las Vigas","to":"China Box","time":5.1833333333,"summary":"","directions":"Head southeast on Müllerstraße. Go for 56 m.Turn left. Go for 11 m.Turn left onto Müllerstraße. Go for 224 m.Arrive at Müllerstraße. Your destination is on the left."},"3":{"from":"China Box","to":"Saray","time":1.55,"summary":"","directions":"Head northwest on Müllerstraße. Go for 69 m.Turn right onto Seestraße. Go for 14 m.Arrive at Seestraße. Your destination is on the left."},"4":{"from":"Saray","to":"Java House","time":8.9833333333,"summary":"106","directions":"Head southwest on Seestraße. Go for 14 m.Turn right. Go for 26 m.Go to the stop U Seestr. and take the bus 106 toward Berlin, Lindenhof. Follow for 1 stop.Get off at Berlin, Antwerpener Str..Head southeast. Go for 15 m.Turn right. Go for 11 m.Turn left onto Antwerpener Straße. Go for 191 m.Turn right onto Brüsseler Straße. Go for 43 m.Arrive at Brüsseler Straße. Your destination is on the right."},"5":{"from":"Java House","to":"La Brasserie de France","time":22.1,"summary":"U6","directions":"Head northeast on Brüsseler Straße. Go for 60 m.Turn left onto Antwerpener Straße. Go for 191 m.Turn right onto Seestraße. Go for 297 m.Turn left. Go for 26 m.Go to the station U Seestr. and take the rail U6 toward U Alt-Tegel. Follow for 1 station.Get off at U Rehberge.Head southwest on Müllerstraße. Go for 326 m.Turn right. Go for 11 m.Turn right onto Müllerstraße. Go for 102 m.Arrive at Müllerstraße. Your destination is on the left."},"6":{"from":"La Brasserie de France","to":"PAPADAM","time":12.0166666667,"summary":"","directions":"Head northwest on Müllerstraße. Go for 720 m.Arrive at Scharnweberstraße. Your destination is on the right."},"7":{"from":"PAPADAM","to":"Hongkong Express","time":6.2166666667,"summary":"","directions":"Head southeast on Scharnweberstraße. Go for 79 m.Turn right. Go for 284 m.Arrive at your destination."},"8":{"from":"Hongkong Express","to":"Zadar Restaurant","time":31.75,"summary":"U6, X33","directions":"Head northeast. Go for 272 m.Turn right onto Scharnweberstraße. Go for 170 m.Go to the station U Afrikanische Str. and take the rail U6 toward U Alt-Tegel. Follow for 4 stations.Get off at U Holzhauser Str..Walk to U Holzhauser Str..Take the bus X33 toward Berlin, Wilhelmsruher Damm. Follow for 1 stop.Get off at Berlin, Holzhauser Str.\/Schubartstr..Head southwest on Schubartstraße. Go for 318 m.Turn left onto Ernststraße. Go for 114 m.Turn right onto Räuschstraße. Go for 17 m.Arrive at Räuschstraße. Your destination is on the left."},"9":{"from":"Zadar Restaurant","to":"Marché Sucre","time":19.5166666667,"summary":"","directions":"Head southeast on Räuschstraße. Go for 17 m.Turn right onto Ernststraße. Go for 476 m.Continue straight onto Ernststraße. Go for 103 m.Turn left onto Ernststraße. Go for 16 m.Turn left onto Ernststraße. Go for 325 m.Turn right onto Berliner Straße. Go for 118 m.Turn left onto Am Borsigturm. Go for 75 m.Arrive at Am Borsigturm. Your destination is on the left."},"10":{"from":"Marché Sucre","to":"Mali Raj","time":30.1833333333,"summary":"U6, X33","directions":"Head east on Am Borsigturm. Go for 75 m.Turn right onto Berliner Straße. Go for 118 m.Turn left onto Am Borsigturm. Go for 108 m.Turn right onto Berliner Straße. Go for 51 m.Go to the station U Borsigwerke and take the rail U6 toward U Alt-Mariendorf. Follow for 1 station.Get off at U Holzhauser Str..Walk to U Holzhauser Str..Take the bus X33 toward Berlin, Galenstr.. Follow for 6 stops.Get off at Berlin, Siedlung Haselhorst.Head southeast on Gartenfelder Straße. Go for 44 m.Arrive at Gartenfelder Straße. Your destination is on the right."},"11":{"from":"Mali Raj","to":"Eiscafé Mauritius","time":34.7166666667,"summary":"U7, U2","directions":"Head southwest on Gartenfelder Straße. Go for 316 m.Turn left onto Daumstraße. Go for 224 m.Go to the station U Haselhorst and take the rail U7 toward U Rudow. Follow for 9 stations.Get off at U Bismarckstr..Take the rail U2 toward Berlin, U Theodor-Heuss-Platz. Follow for 3 stations.Get off at Berlin, U Theodor-Heuss-Platz.Head south on Theodor-Heuss-Platz. Go for 18 m.Walk left around the roundabout and turn at the 2nd street. Go for 46 m.Turn left. Go for 6 m.Turn left onto Theodor-Heuss-Platz. Go for 40 m.Arrive at Theodor-Heuss-Platz. Your destination is on the right."},"12":{"from":"Eiscafé Mauritius","to":"Tembo African Kitchen","time":18.6666666667,"summary":"U2","directions":"Head east on Theodor-Heuss-Platz. Go for 40 m.Turn right. Go for 6 m.Turn right. Go for 25 m.Walk right around the roundabout and turn onto Theodor-Heuss-Platz. Go for 39 m.Go to the station Berlin, U Theodor-Heuss-Platz and take the rail U2 toward S+U Pankow. Follow for 2 stations.Get off at U Sophie-Charlotte-Platz.Head west. Go for 17 m.Turn slightly left. Go for 81 m.Turn left. Go for 38 m.Turn right. Go for 19 m.Turn slightly left onto Horstweg. Go for 261 m.Turn left onto Horstweg. Go for 99 m.Turn right onto Danckelmannstraße. Go for 144 m.Arrive at Danckelmannstraße. Your destination is on the left."},"13":{"from":"Tembo African Kitchen","to":"Vincent-Burger","time":27.5666666667,"summary":"109","directions":"Head south on Danckelmannstraße. Go for 54 m.Turn left onto Knobelsdorffstraße. Go for 378 m.Turn left onto Schloßstraße. Go for 6 m.Turn right. Go for 30 m.Turn slightly left onto Hebbelstraße. Go for 255 m.Turn right onto Haubachstraße. Go for 93 m.Go to the stop Berlin, Haubachstr. and take the bus 109 toward Berlin, Flughafen Tegel (Airport). Follow for 2 stops.Get off at Berlin, Schlossbrücke.Head southwest on Tegeler Weg. Go for 65 m.Turn left onto Tauroggener Straße. Go for 224 m.Arrive at Tauroggener Straße. Your destination is on the left."},"14":{"from":"Vincent-Burger","to":"Seri Melayu","time":18.75,"summary":"U7","directions":"Head north on Tauroggener Straße. Go for 40 m.Turn right onto Mindener Straße. Go for 131 m.Turn slightly left onto Mierendorffstraße. Go for 39 m.Take the street on the left, Mierendorffplatz. Go for 137 m.Continue straight ahead. Go for 19 m.Turn right. Go for 53 m.Turn right. Go for 47 m.Go to the station U Mierendorffplatz and take the rail U7 toward U Rudow. Follow for 3 stations.Get off at U Wilmersdorfer Str..Head north on Wilmersdorfer Straße. Go for 28 m.Turn left onto Kantstraße. Go for 159 m.Arrive at Kantstraße. Your destination is on the left."},"15":{"from":"Seri Melayu","to":"Restorant Macedonia (Berlin)","time":6.4,"summary":"","directions":"Head west on Kantstraße. Go for 131 m.Turn left onto Kaiser-Friedrich-Straße. Go for 241 m.Arrive at Lewishamstraße. Your destination is on the right."},"16":{"from":"Restorant Macedonia (Berlin)","to":"La Batea","time":11.5333333333,"summary":"","directions":"Head northwest on Lewishamstraße. Go for 89 m.Turn right. Go for 579 m.Arrive at Krumme Straße. Your destination is on the right."},"17":{"from":"La Batea","to":"Makenene","time":6.7166666667,"summary":"","directions":"Head north on Krumme Straße. Go for 50 m.Turn slightly right. Go for 63 m.Turn left. Go for 41 m.Turn right. Go for 48 m.Turn left onto Weimarer Straße. Go for 193 m.Arrive at Weimarer Straße. Your destination is on the right."},"18":{"from":"Makenene","to":"Odessa Mama","time":31.0,"summary":"U2, U4","directions":"Head north on Weimarer Straße. Go for 34 m.Turn left onto Schillerstraße. Go for 172 m.Turn right onto Krumme Straße. Go for 178 m.Turn right onto Bismarckstraße. Go for 10 m.Go to the station U Deutsche Oper and take the rail U2 toward S+U Pankow. Follow for 4 stations.Get off at U Nollendorfplatz.Take the rail U4 toward S+U Innsbrucker Platz. Follow for 4 stations.Get off at S+U Innsbrucker Platz.Head southeast on Hauptstraße. Go for 125 m.Turn right onto Innsbrucker Platz. Go for 45 m.Arrive at Innsbrucker Platz. Your destination is on the left."},"19":{"from":"Odessa Mama","to":"Baku Napoli","time":18.8,"summary":"M48","directions":"Head northwest on Innsbrucker Platz. Go for 45 m.Turn left onto Hauptstraße. Go for 125 m.Go to the stop S+U Innsbrucker Platz and take the bus M48 toward S+U Alexanderplatz Bhf. Follow for 7 stops.Get off at U Bülowstr..Head west on Bülowstraße. Go for 36 m.Turn left onto Potsdamer Straße. Go for 52 m.Arrive at Potsdamer Straße. Your destination is on the left."},"20":{"from":"Baku Napoli","to":"Ayan Filipino Streetfood","time":10.9333333333,"summary":"M48","directions":"Head north on Potsdamer Straße. Go for 52 m.Turn right onto Bülowstraße. Go for 36 m.Go to the stop U Bülowstr. and take the bus M48 toward S+U Alexanderplatz Bhf. Follow for 2 stops.Get off at Berlin, Lützowstr.\/Potsdamer Str..Head southwest on Potsdamer Straße. Go for 27 m.Arrive at Potsdamer Straße."},"21":{"from":"Ayan Filipino Streetfood","to":"Saeson Nordic Cuisine","time":0.5166666667,"summary":"","directions":"Head northeast on Potsdamer Straße. Go for 31 m.Arrive at Potsdamer Straße. Your destination is on the right."},"22":{"from":"Saeson Nordic Cuisine","to":"Panama Restaurant & Bar","time":7.7,"summary":"","directions":"Head southwest on Potsdamer Straße. Go for 336 m.Turn left onto Pohlstraße. Go for 114 m.Arrive at Pohlstraße. Your destination is on the left."},"23":{"from":"Panama Restaurant & Bar","to":"Munch's Hus","time":14.3333333333,"summary":"","directions":"Head west on Pohlstraße. Go for 114 m.Turn left onto Potsdamer Straße. Go for 339 m.Turn left onto Bülowstraße. Go for 327 m.Take the street on the right, Bülowstraße. Go for 58 m.Arrive at Bülowstraße. Your destination is on the left."},"24":{"from":"Munch's Hus","to":"El Chilenito","time":27.15,"summary":"U7","directions":"Head south on Bülowstraße. Go for 141 m.Turn left onto Bülowstraße. Go for 170 m.Take the street on the left, Bülowstraße. Go for 62 m.Turn left onto Yorckstraße. Go for 230 m.Go to the station S+U Yorckstr. and take the rail U7 toward U Rudow. Follow for 2 stations.Get off at U Mehringdamm.Head east on Mehringdamm. Go for 409 m.Turn left onto Bergmannstraße. Go for 189 m.Arrive at Bergmannstraße. Your destination is on the left."},"25":{"from":"El Chilenito","to":"Finnish Pulled Pork","time":8.5,"summary":"","directions":"Head east on Bergmannstraße. Go for 313 m.Turn left onto Zossener Straße. Go for 187 m.Arrive at Zossener Straße. Your destination is on the left."},"26":{"from":"Finnish Pulled Pork","to":"Ron Telesky Canadian Pizza","time":19.4,"summary":"U7","directions":"Head north on Zossener Straße. Go for 74 m.Turn right onto Gneisenaustraße. Go for 70 m.Go to the station U Gneisenaustr. and take the rail U7 toward U Rudow. Follow for 1 station.Get off at U Südstern.Head southwest on Südstern. Go for 23 m.Turn left onto Körtestraße. Go for 470 m.Turn slightly right. Go for 142 m.Turn right. Go for 20 m.Turn left. Go for 10 m.Turn slightly right. Go for 19 m.Turn slightly right onto Dieffenbachstraße. Go for 51 m.Arrive at Dieffenbachstraße. Your destination is on the left."},"27":{"from":"Ron Telesky Canadian Pizza","to":"Lasan","time":16.2166666667,"summary":"","directions":"Head west on Dieffenbachstraße. Go for 51 m.Turn right. Go for 163 m.Turn slightly right onto Böckhstraße. Go for 13 m.Continue straight onto Admiralbrücke. Go for 229 m.Continue straight onto Admiralstraße. Go for 70 m.Walk right around the roundabout and turn at the 2nd street Admiralstraße. Go for 205 m.Turn right onto Skalitzer Straße. Go for 41 m.Walk left around the roundabout and turn at the 4th street Adalbertstraße. Go for 129 m.Arrive at Adalbertstraße. Your destination is on the left."},"28":{"from":"Lasan","to":"Senegambia","time":16.0833333333,"summary":"M29","directions":"Head northeast on Adalbertstraße. Go for 175 m.Turn right onto Oranienstraße. Go for 1 m.Go to the stop Berlin, Adalbertstr.\/Oranienstr. and take the bus M29 toward U Hermannplatz\/Urbanstr.. Follow for 4 stops.Get off at Berlin, Ohlauer Str..Head southwest on Reichenberger Straße. Go for 249 m.Arrive at Reichenberger Straße. Your destination is on the left."},"29":{"from":"Senegambia","to":"helloandgoodpie","time":16.15,"summary":"","directions":"Head southeast on Reichenberger Straße. Go for 121 m.Turn left onto Liegnitzer Straße. Go for 210 m.Turn right onto Wiener Straße. Go for 12 m.Turn left. Go for 31 m.Turn right. Go for 122 m.Turn right onto Görlitzer Bahn Weg. Go for 76 m.Turn left. Go for 378 m.Arrive at Falckensteinstraße."},"30":{"from":"helloandgoodpie","to":"Zum Nussbaum","time":45.8166666667,"summary":"M29, M41","directions":"Head southwest on Falckensteinstraße. Go for 285 m.Continue straight ahead. Go for 403 m.Turn right onto Reichenberger Straße. Go for 14 m.Go to the stop Berlin, Glogauer Str. and take the bus M29 toward U Hermannplatz\/Urbanstr.. Follow for 2 stops.Get off at Berlin, Sonnenallee\/Pannierstr..Take the bus M41 toward Berlin, Sonnenallee\/ Baumschulenstr.. Follow for 10 stops.Get off at Berlin, Schulenburgpark.Head northeast on Sonnenallee. Go for 74 m.Turn right. Go for 11 m.Turn right onto Sonnenallee. Go for 119 m.Turn left. Go for 234 m.Turn right. Go for 42 m.Turn right onto Weg Nr. 3. Go for 128 m.Arrive at Weg Nr. 3. Your destination is on the right."},"31":{"from":"Zum Nussbaum","to":"King Wok","time":58.4,"summary":"S46, S42, S7","directions":"Head southwest on Weg Nr. 3. Go for 128 m.Turn right. Go for 97 m.Turn right onto Weg Nr. 5. Go for 250 m.Turn left onto Sonnenallee. Go for 125 m.Turn right onto Planetenstraße. Go for 102 m.Go to the station S Köllnische Heide and take the rail S46 toward S+U Gesundbrunnen Bhf. Follow for 1 station.Get off at S+U Neukölln.Take the rail S42. Follow for 3 stations.Get off at S Ostkreuz Bhf.Take the rail S7 toward S Ahrensfelde Bhf. Follow for 6 stations.Get off at S Marzahn.Head west. Go for 179 m.Turn right. Go for 65 m.Arrive at your destination on the right."},"32":{"from":"King Wok","to":"kärrecho","time":39.05,"summary":"S7","directions":"Head north. Go for 65 m.Turn left onto Marzahner Promenade. Go for 179 m.Go to the station S Marzahn and take the rail S7 toward S Potsdam Hauptbahnhof. Follow for 6 stations.Get off at S Ostkreuz Bhf.Head south on Hauptstraße. Go for 62 m.Turn right onto Gebäude. Go for 130 m.Head northwest on Sonntagstraße. Go for 36 m.Turn right onto Sonntagstraße. Go for 68 m.Turn right onto Neue Bahnhofstraße. Go for 281 m.Arrive at Neue Bahnhofstraße. Your destination is on the left."},"33":{"from":"kärrecho","to":"Mecato","time":16.9,"summary":"240","directions":"Head southwest on Neue Bahnhofstraße. Go for 67 m.Turn right onto Boxhagener Straße. Go for 51 m.Go to the stop Berlin, Neue Bahnhofstr. and take the bus 240 toward S Ostbahnhof. Follow for 4 stops.Get off at Berlin, Simon-Dach-Str..Head north on Grünberger Straße. Go for 22 m.Turn right onto Simon-Dach-Straße. Go for 208 m.Turn slightly left onto Simplonstraße. Go for 75 m.Arrive at Simplonstraße. Your destination is on the right."},"34":{"from":"Mecato","to":"Oase","time":6.95,"summary":"","directions":"Head northwest on Simplonstraße. Go for 20 m.Continue straight onto Simplonstraße. Go for 367 m.Turn left. Go for 27 m.Arrive at your destination on the left."},"35":{"from":"Oase","to":"Prager Hopfenstube","time":14.2166666667,"summary":"M10","directions":"Head south. Go for 151 m.Go to the station Berlin, Revaler Str. and take the rail M10 toward Berlin, Lüneburger Str.. Follow for 2 stations.Get off at U Frankfurter Tor.Head south on Frankfurter Tor. Go for 25 m.Turn right onto Frankfurter Tor. Go for 49 m.Turn left. Go for 358 m.Arrive at Karl-Marx-Allee. Your destination is on the left."},"36":{"from":"Prager Hopfenstube","to":"Sofia Bar","time":25.9,"summary":"","directions":"Head west on Karl-Marx-Allee. Go for 181 m.Turn right onto Platz. Go for 42 m.Head northwest on Karl-Marx-Allee. Go for 46 m.Turn left onto Weidenweg. Go for 246 m.Turn right. Go for 73 m.Turn right onto Friedenstraße. Go for 734 m.Turn left onto Landsberger Allee. Go for 181 m.Turn right onto Platz der Vereinten Nationen. Go for 24 m.Arrive at Platz der Vereinten Nationen. Your destination is on the left."},"37":{"from":"Sofia Bar","to":"KIRSONS Alexa","time":27.2833333333,"summary":"M6","directions":"Head south on Platz der Vereinten Nationen. Go for 24 m.Turn left onto Platz der Vereinten Nationen. Go for 110 m.Turn right. Go for 20 m.Turn left onto Platz der Vereinten Nationen. Go for 25 m.Go to the station Berlin, Platz der Vereinten Nationen and take the rail M6 toward S Hackescher Markt. Follow for 3 stations.Get off at U Alexanderplatz.Head north on Alexanderstraße. Go for 48 m.Turn right onto Alexanderplatz. Go for 20 m.Turn right onto Alexanderplatz. Go for 114 m.Turn left onto Alexanderplatz. Go for 120 m.Turn slightly right. Go for 28 m.Turn right onto Grunerstraße. Go for 121 m.Turn left onto Stadtbahnbogen. Go for 232 m.Arrive at Stadtbahnbogen. Your destination is on the left."},"38":{"from":"KIRSONS Alexa","to":"Rodolfos Tapas Bar","time":21.9333333333,"summary":"U2","directions":"Head south on Stadtbahnbogen. Go for 84 m.Turn right onto Voltairestraße. Go for 122 m.Continue straight ahead. Go for 31 m.Turn right onto Waisenstraße. Go for 59 m.Turn left onto Parochialstraße. Go for 85 m.Go to the station U Klosterstr. and take the rail U2 toward S+U Pankow. Follow for 3 stations.Get off at U Senefelderplatz.Head northwest on Schwedter Straße. Go for 360 m.Turn right onto Choriner Straße. Go for 74 m.Arrive at Choriner Straße. Your destination is on the right."},"39":{"from":"Rodolfos Tapas Bar","to":"Savanna","time":12.4,"summary":"","directions":"Head northeast on Choriner Straße. Go for 715 m.Turn left onto Hagenauer Straße. Go for 13 m.Arrive at Hagenauer Straße. Your destination is on the right."},"40":{"from":"Savanna","to":"Mitho Cha","time":7.4333333333,"summary":"","directions":"Head south on Hagenauer Straße. Go for 13 m.Turn left onto Sredzkistraße. Go for 368 m.Turn right onto Rykestraße. Go for 44 m.Arrive at Rykestraße. Your destination is on the right."},"41":{"from":"Mitho Cha","to":"Al Hamra","time":11.8333333333,"summary":"","directions":"Head northeast on Rykestraße. Go for 44 m.Turn left onto Sredzkistraße. Go for 113 m.Turn right onto Kollwitzstraße. Go for 317 m.Turn left onto Göhrener Straße. Go for 178 m.Turn left onto Raumerstraße. Go for 13 m.Arrive at Raumerstraße. Your destination is on the left."},"42":{"from":"Al Hamra","to":"Qea cafe","time":18.4333333333,"summary":"","directions":"Head west on Raumerstraße. Go for 650 m.Turn right onto Schönhauser Allee. Go for 362 m.Turn left onto Gleimstraße. Go for 70 m.Arrive at Gleimstraße. Your destination is on the right."},"43":{"from":"Qea cafe","to":"Al Sham Snacks","time":26.9,"summary":"S42, U8","directions":"Head east on Gleimstraße. Go for 49 m.Turn left onto Schönhauser Allee. Go for 223 m.Turn right. Go for 149 m.Go to the station S+U Schönhauser Allee and take the rail S42. Follow for 1 station.Get off at S+U Gesundbrunnen Bhf.Walk to S+U Gesundbrunnen Bhf.Take the rail U8 toward S+U Wittenau. Follow for 2 stations.Get off at U Osloer Str..Head southwest on Schwedenstraße. Go for 79 m.Turn right onto Osloer Straße. Go for 94 m.Turn left onto Heinz-Galinski-Straße. Go for 62 m.Arrive at Heinz-Galinski-Straße. Your destination is on the right."},"44":{"from":"Al Sham Snacks","to":"Balkan Grill","time":5.3333333333,"summary":"","directions":"Head south on Heinz-Galinski-Straße. Go for 209 m.Turn left. Go for 55 m.Turn left onto Exerzierstraße. Go for 38 m.Arrive at Exerzierstraße. Your destination is on the right."},"45":{"from":"Balkan Grill","to":"Restaurant Etoile","time":1.3,"summary":"","directions":"Head east on Exerzierstraße. Go for 77 m.Arrive at Exerzierstraße. Your destination is on the left."},"46":{"from":"Restaurant Etoile","to":"Bei Olek","time":2.05,"summary":"","directions":"Head east on Exerzierstraße. Go for 72 m.Turn right onto Gottschedstraße. Go for 38 m.Arrive at Gottschedstraße. Your destination is on the left."},"47":{"from":"Bei Olek","to":"Schweizer","time":24.15,"summary":"U9, U6","directions":"Head northeast on Gottschedstraße. Go for 38 m.Turn left onto Exerzierstraße. Go for 586 m.Go to the station U Nauener Platz and take the rail U9 toward S+U Rathaus Steglitz. Follow for 1 station.Get off at U Leopoldplatz.Take the rail U6 toward U Alt-Mariendorf. Follow for 3 stations.Get off at U Schwartzkopffstr..Head northwest on Chausseestraße. Go for 103 m.Turn right onto Wöhlertstraße. Go for 150 m.Arrive at Wöhlertstraße. Your destination is on the right."},"48":{"from":"Schweizer","to":"Golden Rice","time":9.7666666667,"summary":"U6","directions":"Head west on Wöhlertstraße. Go for 150 m.Turn left onto Chausseestraße. Go for 103 m.Go to the station U Schwartzkopffstr. and take the rail U6 toward U Alt-Mariendorf. Follow for 1 station.Get off at U Naturkundemuseum.Head southwest on Chausseestraße. Go for 118 m.Arrive at Chausseestraße. Your destination is on the right."},"49":{"from":"Golden Rice","to":"Casalot","time":7.7166666667,"summary":"U6","directions":"Head southeast on Chausseestraße. Go for 118 m.Go to the station U Naturkundemuseum and take the rail U6 toward U Alt-Mariendorf. Follow for 1 station.Get off at U Oranienburger Tor.Head south on Friedrichstraße. Go for 12 m.Turn right onto Claire-Waldoff-Straße. Go for 88 m.Arrive at Claire-Waldoff-Straße. Your destination is on the left."},"50":{"from":"Casalot","to":"Casalot","time":0.0,"summary":"","directions":"Head north on Claire-Waldoff-Straße.Arrive at Claire-Waldoff-Straße. Your destination is on the right."},"51":{"from":"Casalot","to":"Casalot","time":0.0,"summary":"","directions":"Head north on Claire-Waldoff-Straße.Arrive at Claire-Waldoff-Straße. Your destination is on the right."},"52":{"from":"Casalot","to":"Casalot","time":0.0,"summary":"","directions":"Head north on Claire-Waldoff-Straße.Arrive at Claire-Waldoff-Straße. Your destination is on the right."},"53":{"from":"Casalot","to":"Joseph","time":2.8666666667,"summary":"","directions":"Head northeast on Claire-Waldoff-Straße. Go for 75 m.Turn left onto Friedrichstraße. Go for 89 m.Arrive at Friedrichstraße. Your destination is on the left."},"54":{"from":"Joseph","to":"Natas","time":1.3333333333,"summary":"","directions":"Head north on Friedrichstraße. Go for 49 m.Turn right onto Oranienburger Straße. Go for 21 m.Arrive at Oranienburger Straße. Your destination is on the left."},"55":{"from":"Natas","to":"SAUSALITOS","time":1.0166666667,"summary":"","directions":"Head east on Oranienburger Straße. Go for 61 m.Arrive at Oranienburger Straße. Your destination is on the right."},"56":{"from":"SAUSALITOS","to":"Kin-Za","time":10.0166666667,"summary":"","directions":"Head southeast on Oranienburger Straße. Go for 33 m.Turn left onto Oranienburger Straße. Go for 487 m.Turn left onto Krausnickstraße. Go for 70 m.Arrive at Krausnickstraße. Your destination is on the left."},"57":{"from":"Kin-Za","to":"Rethink Küche","time":16.3,"summary":"","directions":"Head southwest on Krausnickstraße. Go for 70 m.Turn right onto Oranienburger Straße. Go for 15 m.Turn left onto Monbijoustraße. Go for 319 m.Turn left onto Am Kupfergraben. Go for 296 m.Turn left onto Am Kupfergraben. Go for 89 m.Continue straight onto Am Zeughaus. Go for 157 m.Arrive at Am Zeughaus. Your destination is on the right."},"58":{"from":"Rethink Küche","to":"Pecados","time":14.7833333333,"summary":"","directions":"Head south on Am Zeughaus. Go for 38 m.Turn right onto Unter den Linden. Go for 42 m.Turn left onto Niederlagstraße. Go for 558 m.Turn right onto Alte Leipziger Straße. Go for 23 m.Turn left. Go for 81 m.Turn slightly right onto Kronenstraße. Go for 118 m.Arrive at Kronenstraße. Your destination is on the right."},"59":{"from":"Pecados","to":"Gasthaus Glashaus","time":16.65,"summary":"","directions":"Head east on Kronenstraße. Go for 118 m.Turn right onto Niederwallstraße. Go for 69 m.Turn right. Go for 2 m.Turn right onto Axel-Springer-Straße. Go for 791 m.Arrive at Lindenstraße. Your destination is on the right."},"60":{"from":"Gasthaus Glashaus","to":"Tunnbrödsrulle - Swedish Hot Dog Wrap","time":12.55,"summary":"","directions":"Head northeast on Lindenstraße. Go for 14 m.Turn left onto Lindenstraße. Go for 199 m.Turn right onto Markgrafenstraße. Go for 288 m.Turn left onto Schützenstraße. Go for 227 m.Arrive at Schützenstraße. Your destination is on the left."},"61":{"from":"Tunnbrödsrulle - Swedish Hot Dog Wrap","to":"Royals & Rice x Sons of Mana @Quartier 205","time":8.7,"summary":"","directions":"Head west on Schützenstraße. Go for 37 m.Turn right onto Friedrichstraße. Go for 398 m.Turn right onto Mohrenstraße. Go for 65 m.Arrive at Mohrenstraße. Your destination is on the left."},"62":{"from":"Royals & Rice x Sons of Mana @Quartier 205","to":"Lido","time":11.35,"summary":"","directions":"Head east on Mohrenstraße. Go for 67 m.Turn left onto Charlottenstraße. Go for 559 m.Turn right onto Unter den Linden. Go for 36 m.Arrive at Unter den Linden. Your destination is on the left."},"63":{"from":"Lido","to":"Naveena Path","time":2.9333333333,"summary":"","directions":"Head west on Unter den Linden. Go for 36 m.Turn right onto Charlottenstraße. Go for 103 m.Turn left onto Mittelstraße. Go for 17 m.Arrive at Mittelstraße. Your destination is on the right."},"64":{"from":"Naveena Path","to":"Egyptian Street Food","time":8.0833333333,"summary":"","directions":"Head west on Mittelstraße. Go for 116 m.Turn right onto Friedrichstraße. Go for 202 m.Turn left onto Georgenstraße. Go for 148 m.Arrive at Georgenstraße."},"65":{"from":"Egyptian Street Food","to":"Alto Bar & Restaurant","time":22.9166666667,"summary":"U6","directions":"Head east on Georgenstraße. Go for 148 m.Turn left onto Friedrichstraße. Go for 65 m.Turn left. Go for 103 m.Go to the station S+U Friedrichstr. Bhf and take the rail U6 toward U Alt-Tegel. Follow for 2 stations.Get off at U Naturkundemuseum.Head southwest on Chausseestraße. Go for 94 m.Turn right onto Invalidenstraße. Go for 349 m.Turn left onto Luisenstraße. Go for 103 m.Turn right onto Robert-Koch-Platz. Go for 50 m.Arrive at Hannoversche Straße. Your destination is on the right."},"66":{"from":"Alto Bar & Restaurant","to":"Fruhstuckbar","time":11.2833333333,"summary":"M10","directions":"Head east on Hannoversche Straße. Go for 11 m.Turn left onto Platz vor dem Neuen Tor. Go for 76 m.Continue straight onto Platz vor dem Neuen Tor. Go for 89 m.Go to the station Berlin, Invalidenpark and take the rail M10 toward Berlin, Lüneburger Str.. Follow for 1 station.Get off at S+U Berlin Hauptbahnhof.Head south on Europaplatz. Go for 54 m.Turn left onto Ella-Trebe-Straße. Go for 190 m.Arrive at Ella-Trebe-Straße. Your destination is on the left."},"67":{"from":"Fruhstuckbar","to":"Tiramisus","time":15.3666666667,"summary":"M10","directions":"Head north on Ella-Trebe-Straße. Go for 190 m.Turn right onto Europaplatz. Go for 53 m.Go to the station S+U Berlin Hauptbahnhof and take the rail M10 toward Berlin, Lüneburger Str.. Follow for 1 station.Get off at Berlin, Lesser-Ury-Weg.Head southeast on Invalidenstraße. Go for 99 m.Turn slightly right onto Invalidenstraße. Go for 81 m.Turn right onto Alt-Moabit. Go for 195 m.Turn left onto Paulstraße. Go for 59 m.Arrive at Paulstraße. Your destination is on the right."},"68":{"from":"Tiramisus","to":"Angkor Wat","time":5.3833333333,"summary":"","directions":"Head south on Paulstraße. Go for 322 m.Arrive at Paulstraße."},"69":{"from":"Angkor Wat","to":"Marjan Grill","time":11.85,"summary":"","directions":"Head south on Paulstraße. Go for 73 m.Turn right onto Lüneburger Straße. Go for 272 m.Turn right onto Helgoländer Ufer. Go for 87 m.Turn left onto Gerickesteg. Go for 271 m.Arrive at Flensburger Straße. Your destination is on the left."},"70":{"from":"Marjan Grill","to":"Naninka","time":19.0166666667,"summary":"U9","directions":"Head east on Flensburger Straße. Go for 18 m.Turn right onto Bartningallee. Go for 456 m.Go to the station U Hansaplatz and take the rail U9 toward U Osloer Str.. Follow for 1 station.Get off at U Turmstr..Head west. Go for 48 m.Turn left onto Turmstraße. Go for 151 m.Turn right onto Jonasstraße. Go for 158 m.Arrive at Jonasstraße. Your destination is on the left."},"71":{"from":"Naninka","to":"Puszta","time":0.1833333333,"summary":"","directions":"Head north on Jonasstraße. Go for 11 m.Arrive at Jonasstraße. Your destination is on the left."},"72":{"from":"Puszta","to":"Pignut BBQ","time":3.1166666667,"summary":"","directions":"Head north on Jonasstraße. Go for 36 m.Turn left onto Bugenhagenstraße. Go for 79 m.Turn left onto Bremer Straße. Go for 53 m.Arrive at Bremer Straße. Your destination is on the left."},"73":{"from":"Pignut BBQ","to":"Sahara-city","time":6.4,"summary":"","directions":"Head south on Bremer Straße. Go for 149 m.Turn right onto Turmstraße. Go for 155 m.Turn left onto Ottostraße. Go for 57 m.Arrive at Ottostraße. Your destination is on the left."},"74":{"from":"Sahara-city","to":"Weimarer Dreieck","time":7.0666666667,"summary":"","directions":"Head south on Ottostraße. Go for 59 m.Turn left onto Ottoplatz. Go for 31 m.Turn right onto Ottoplatz. Go for 271 m.Turn left onto Essener Straße. Go for 46 m.Arrive at Essener Straße. Your destination is on the right."},"75":{"from":"Weimarer Dreieck","to":"Sancho Panza","time":10.5666666667,"summary":"","directions":"Head west on Essener Straße. Go for 46 m.Turn right onto Elberfelder Straße. Go for 174 m.Turn left onto Alt-Moabit. Go for 385 m.Arrive at Alt-Moabit. Your destination is on the right."},"76":{"from":"Sancho Panza","to":"Ya-Man","time":2.2666666667,"summary":"","directions":"Head west on Alt-Moabit. Go for 70 m.Turn right onto Gotzkowskystraße. Go for 54 m.Arrive at Gotzkowskystraße. Your destination is on the right."},"77":{"from":"Ya-Man","to":"Taste Singapore Style","time":2.0833333333,"summary":"","directions":"Head south on Gotzkowskystraße. Go for 54 m.Turn right onto Alt-Moabit. Go for 59 m.Arrive at Alt-Moabit. Your destination is on the right."},"78":{"from":"Taste Singapore Style","to":"Original Taiwanesische Bauernstube","time":12.1,"summary":"245","directions":"Head east on Alt-Moabit. Go for 72 m.Turn left. Go for 16 m.Go to the stop Berlin, Alt-Moabit\/Gotzkowskystr. and take the bus 245 toward Berlin, Hertzallee. Follow for 2 stops.Get off at Berlin, Helmholtzstr..Head north on Helmholtzstraße. Go for 88 m.Turn left onto Morsestraße. Go for 21 m.Arrive at Morsestraße. Your destination is on the right."},"79":{"from":"Original Taiwanesische Bauernstube","to":"El Reda","time":17.8166666667,"summary":"101","directions":"Head south on Morsestraße. Go for 21 m.Turn right onto Helmholtzstraße. Go for 88 m.Go to the stop Berlin, Helmholtzstr. and take the bus 101 toward Berlin, Turmstr.\/Lübecker Str.. Follow for 3 stops.Get off at Berlin, Turmstr.\/Waldstr..Head east on Gotzkowskystraße. Go for 19 m.Turn left onto Turmstraße. Go for 228 m.Arrive at Huttenstraße. Your destination is on the right."},"80":{"from":"El Reda","to":"Finest's The Irish Pub","time":4.8,"summary":"","directions":"Head east on Huttenstraße. Go for 216 m.Turn left onto Waldstraße. Go for 59 m.Arrive at Waldstraße. Your destination is on the left."},"81":{"from":"Finest's The Irish Pub","to":"African Kingdom","time":11.9333333333,"summary":"","directions":"Head north on Waldstraße. Go for 558 m.Turn left onto Siemensstraße. Go for 147 m.Arrive at Siemensstraße. Your destination is on the left."},"82":{"from":"African Kingdom","to":"Deichgraf","time":22.25,"summary":"S41, U9","directions":"Head northwest on Siemensstraße. Go for 18 m.Turn left onto Siemensstraße. Go for 61 m.Turn right onto Beusselstraße. Go for 169 m.Go to the station S Beusselstr. and take the rail S41. Follow for 1 station.Get off at S+U Westhafen.Walk to S+U Westhafen.Take the rail U9 toward U Osloer Str.. Follow for 1 station.Get off at U Amrumer Str..Head northeast on Torfstraße. Go for 354 m.Turn right onto Nordufer. Go for 33 m.Arrive at Nordufer. Your destination is on the right."},"83":{"from":"Deichgraf","to":"Strudelka","time":12.2333333333,"summary":"","directions":"Head east on Nordufer. Go for 33 m.Turn left onto Torfstraße. Go for 15 m.Turn right onto Kiautschoustraße. Go for 84 m.Turn left. Go for 149 m.Turn right onto Sprengelstraße. Go for 425 m.Turn right onto Sparrplatz. Go for 4 m.Turn left onto Sparrplatz. Go for 15 m.Arrive at Sparrplatz. Your destination is on the right."},"84":{"from":"Strudelka","to":"Vietnamesische Küche - Com Pho Viet","time":8.8333333333,"summary":"","directions":"Head southwest on Sparrplatz. Go for 15 m.Turn right onto Sparrplatz. Go for 4 m.Turn right onto Triftstraße. Go for 136 m.Turn right onto Triftstraße. Go for 30 m.Turn left onto Genter Straße. Go for 182 m.Turn right onto Luxemburger Straße. Go for 122 m.Arrive at Luxemburger Straße. Your destination is on the left."},"85":{"from":"Vietnamesische Küche - Com Pho Viet","to":"Dan Thai Food","time":14.25,"summary":"U9","directions":"Head northeast on Luxemburger Straße. Go for 96 m.Go to the station U Leopoldplatz and take the rail U9 toward U Osloer Str.. Follow for 1 station.Get off at U Nauener Platz.Head northeast on Reinickendorfer Straße. Go for 7 m.Turn right onto Reinickendorfer Straße. Go for 461 m.Arrive at Reinickendorfer Straße. Your destination is on the right."},"86":{"from":"Dan Thai Food","to":"Snack Al Hara","time":6.2,"summary":"","directions":"Head north on Reinickendorfer Straße. Go for 372 m.Arrive at Reinickendorfer Straße. Your destination is on the right."},"87":{"from":"Snack Al Hara","to":"Stranero","time":6.4,"summary":"","directions":"Head north on Reinickendorfer Straße. Go for 166 m.Turn left onto Liebenwalder Straße. Go for 208 m.Arrive at Liebenwalder Straße. Your destination is on the right."},"88":{"from":"Stranero","to":"Taverna Hellas","time":14.85,"summary":"","directions":"Head east on Liebenwalder Straße. Go for 208 m.Turn left onto Reinickendorfer Straße. Go for 556 m.Turn slightly right. Go for 39 m.Turn left. Go for 41 m.Turn left. Go for 29 m.Arrive at your destination on the right."},"89":{"from":"Taverna Hellas","to":"Sam Yuk Gu","time":9.25,"summary":"","directions":"Head southeast. Go for 29 m.Turn right. Go for 41 m.Turn right. Go for 39 m.Turn slightly left. Go for 31 m.Turn right onto Seestraße. Go for 399 m.Arrive at Seestraße. Your destination is on the left."},"90":{"from":"Sam Yuk Gu","to":"WSB","time":3.9833333333,"summary":"","directions":"Head southwest on Seestraße. Go for 173 m.Turn left onto Oudenarder Straße. Go for 56 m.Arrive at Oudenarder Straße. Your destination is on the right."}}
